In [1]:
# Pandas基础（一）

In [2]:
import pandas as pd 
import numpy as np

查看Pandas版本（这里需要1.0.0以上版本）

In [3]:
pd.__version__

'1.0.3'

如果不是1.0.0以上版本，就用pip升级一下

In [4]:
# 一、文件读取与写入

In [5]:
# 1.读取

In [6]:
# csv格式
df = pd.read_csv('data/table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [7]:
# txt格式
df_txt = pd.read_table('data/table.txt')
df_txt

   col1 col2  col3    col4
0     2    a   1.4   apple
1     3    b   3.4  banana
2     6    c   2.5  orange
3     5    d   3.2   lemon

In [8]:
# xls或xlsx格式（需要有xlrd包）
df_excel = pd.read_excel("data/table.xlsx")
df_excel.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [9]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name='这是一个Series')
s

a   -2.725300
b    1.831979
c    1.011137
d   -0.585430
e    0.559516
Name: 这是一个Series, dtype: float64

In [10]:
df = pd.DataFrame({'clo1':list('abcde'),'clo2':range(5,10),'clo3':[1.1,2.2,3.3,4.4,5.5]},index=list('一二三四五'))
df

  clo1  clo2  clo3
一    a     5   1.1
二    b     6   2.2
三    c     7   3.3
四    d     8   4.4
五    e     9   5.5

In [11]:
df['clo1']

一    a
二    b
三    c
四    d
五    e
Name: clo1, dtype: object

In [12]:
df.rename(index={'一':'one'},columns={'clo1':'new_col1'})

    new_col1  clo2  clo3
one        a     5   1.1
二          b     6   2.2
三          c     7   3.3
四          d     8   4.4
五          e     9   5.5

In [13]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [14]:
df.columns

Index(['clo1', 'clo2', 'clo3'], dtype='object')

In [15]:
df.values

array([['a', 5, 1.1],
       ['b', 6, 2.2],
       ['c', 7, 3.3],
       ['d', 8, 4.4],
       ['e', 9, 5.5]], dtype=object)

In [16]:
df.shape

(5, 3)

In [17]:
df1 = pd.DataFrame({'A':[1,2,3]},index=[1,2,3])
df2 = pd.DataFrame({'A':[1,2,3]},index=[3,1,2])
df1 - df2

   A
1 -1
2 -1
3  2

In [18]:
df.drop(index='五',columns='clo1')

   clo2  clo3
一     5   1.1
二     6   2.2
三     7   3.3
四     8   4.4

In [19]:
df['clo1']=[1,2,3,4,5]
del df['clo1']
df

   clo2  clo3
一     5   1.1
二     6   2.2
三     7   3.3
四     8   4.4
五     9   5.5

In [20]:
df['clo1']=[1,2,3,4,5]
df.pop('clo1')

一    1
二    2
三    3
四    4
五    5
Name: clo1, dtype: int64

In [21]:
df

   clo2  clo3
一     5   1.1
二     6   2.2
三     7   3.3
四     8   4.4
五     9   5.5

In [22]:
df1['B'] = list('abc')
df1

   A  B
1  1  a
2  2  b
3  3  c

In [23]:
df1.assign(C=pd.Series(list('defg')))

   A  B  C
1  1  a  e
2  2  b  f
3  3  c  g

In [24]:
df1

   A  B
1  1  a
2  2  b
3  3  c

In [25]:
df.select_dtypes(include=['number']).head()

   clo2  clo3
一     5   1.1
二     6   2.2
三     7   3.3
四     8   4.4
五     9   5.5

In [26]:
df.select_dtypes(include=['float'])

   clo3
一   1.1
二   2.2
三   3.3
四   4.4
五   5.5

In [27]:
s = df.mean()
s

clo2    7.0
clo3    3.3
dtype: float64

In [28]:
s.to_frame()

        0
clo2  7.0
clo3  3.3

In [29]:
s.to_frame().T

   clo2  clo3
0   7.0   3.3

In [30]:
df = pd.read_csv('data/table.csv')

In [31]:
df.head(10)

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+
5    S_1   C_2  1201      M  street_5     188      68  97.0      A-
6    S_1   C_2  1202      F  street_4     176      94  63.5      B-
7    S_1   C_2  1203      M  street_6     160      53  58.8      A+
8    S_1   C_2  1204      F  street_5     162      63  33.8       B
9    S_1   C_2  1205      F  street_6     167      63  68.4      B-

In [32]:
df.tail()

   School Class    ID Gender   Address  Height  Weight  Math Physics
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

In [33]:
df['Physics'].nunique()

7

In [34]:
df['Physics'].unique()

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   35 non-null     object
 1   Class    35 non-null     object
 2   ID       35 non-null     int64
 3   Gender   35 non-null     object
 4   Address  35 non-null     object
 5   Height   35 non-null     int64
 6   Weight   35 non-null     int64
 7   Math     35 non-null     float64
 8   Physics  35 non-null     object
dtypes: float64(1), int64(3), object(5)
memory usage: 2.6+ KB

In [36]:
df.describe()

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
max    2405.00000  195.000000  100.000000  97.000000

In [37]:
df['Physics'].describe()

count     35
unique     7
top       B+
freq       9
Name: Physics, dtype: object

In [38]:
df['Math'].idxmax()

5

In [39]:
df['Math'].nlargest()

5     97.0
28    95.5
11    87.7
2     87.2
24    85.4
Name: Math, dtype: float64

In [40]:
df['Math'].head(7)

0    34.0
1    32.5
2    87.2
3    80.4
4    84.8
5    97.0
6    63.5
Name: Math, dtype: float64

In [41]:
df['Math'].clip()

0     34.0
1     32.5
2     87.2
3     80.4
4     84.8
5     97.0
6     63.5
7     58.8
8     33.8
9     68.4
10    31.5
11    87.7
12    49.7
13    85.2
14    61.7
15    83.3
16    50.6
17    52.5
18    72.2
19    34.2
20    39.1
21    68.5
22    73.8
23    47.2
24    85.4
25    72.3
26    32.7
27    65.9
28    95.5
29    48.9
30    45.3
31    48.7
32    59.7
33    67.7
34    47.6
Name: Math, dtype: float64

In [42]:
df['Math'].apply(lambda x:str(x)+'!').head()

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

In [44]:
df.set_index('Math').sort_index().head()

     School Class    ID Gender   Address  Height  Weight Physics
Math
31.5    S_1   C_3  1301      M  street_4     161      68      B+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
32.7    S_2   C_3  2302      M  street_5     171      88       A
33.8    S_1   C_2  1204      F  street_5     162      63       B
34.0    S_1   C_1  1101      M  street_1     173      63      A+

### 2. 练习
#### 【练习一】 现有一份关于美剧《权力的游戏》剧本的数据集，请解决以下问题：
#### （a）在所有的数据中，一共出现了多少人物？
#### （b）以单元格计数（即简单把一个单元格视作一句），谁说了最多的话？
#### （c）以单词计数，谁说了最多的单词

In [48]:
game = pd.read_csv('data/Game_of_Thrones_Script.csv')
game.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.

In [54]:
game['Name'].nunique()

564

In [50]:
game['Name'].value_counts().head()

tyrion lannister      1760
jon snow              1133
daenerys targaryen    1048
cersei lannister      1005
jaime lannister        945
Name: Name, dtype: int64

In [57]:
game.assign（Words=s1['Sentence'].apply（lambda x:len（x.split（））））.sort_values（by='Name'）s1_list=list（zip（game['Name']，game['Words']））
11=[]
for n in s1_list：
for i in range（n[1]）：
11.append（n[0]）c=collections.Counter（11）#需要collections模块

SyntaxError: invalid character in identifier (<ipython-input-57-6ab293981de4>, line 1)

#### 【练习二】现有一份关于科比的投篮数据集，请解决如下问题：
#### （a）哪种action_type和combined_shot_type的组合是最多的？
#### （b）在所有被记录的game_id中，遭遇到最多的opponent是一个支？

In [53]:
ball = pd.read_csv('data/Kobe_data.csv',index_col='shot_id')
ball.head()

,action_type,combined_shot_type,game_event_id,game_id,lat,loc_x,loc_y,lon,minutes_remaining,period,...,shot_made_flag,shot_type,shot_zone_area,shot_zone_basic,shot_zone_range,team_id,team_name,game_date,matchup,opponent
shot_id,,,,,,,,,,,,,,,,,,,,,
1,Jump Shot,Jump Shot,10,20000012,33.9723,167,72,-118.1028,10,1,...,NaN,2PT Field Goal,Right Side(R),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
2,Jump Shot,Jump Shot,12,20000012,34.0443,-157,0,-118.4268,10,1,...,0.0,2PT Field Goal,Left Side(L),Mid-Range,8-16 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
3,Jump Shot,Jump Shot,35,20000012,33.9093,-101,135,-118.3708,7,1,...,1.0,2PT Field Goal,Left Side Center(LC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
4,Jump Shot,Jump Shot,43,20000012,33.8693,138,175,-118.1318,6,1,...,0.0,2PT Field Goal,Right Side Center(RC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
5,Driving Dunk Shot,Dunk,155,20000012,34.0443,0,0,-118.2698,6,2,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR

In [59]:
ball.sort_values(by=['action_type','combined_shot_type']).head()

,action_type,combined_shot_type,game_event_id,game_id,lat,loc_x,loc_y,lon,minutes_remaining,period,...,shot_made_flag,shot_type,shot_zone_area,shot_zone_basic,shot_zone_range,team_id,team_name,game_date,matchup,opponent
shot_id,,,,,,,,,,,,,,,,,,,,,
145,Alley Oop Dunk Shot,Dunk,77,20000108,34.0443,0,0,-118.2698,3,1,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/11/14,LAL vs. DEN,DEN
182,Alley Oop Dunk Shot,Dunk,328,20000124,34.0443,0,0,-118.2698,11,4,...,NaN,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/11/16,LAL @ SAC,SAC
195,Alley Oop Dunk Shot,Dunk,73,20000140,34.0443,0,0,-118.2698,4,1,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/11/18,LAL @ DEN,DEN
243,Alley Oop Dunk Shot,Dunk,121,20000168,34.0443,0,0,-118.2698,10,2,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/11/22,LAL vs. GSW,GSW
245,Alley Oop Dunk Shot,Dunk,192,20000168,34.0443,0,0,-118.2698,3,2,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/11/22,LAL vs. GSW,GSW

In [62]:
out=pd.Series(list(list(zip(*(pd.Series(list(zip(ball['game_id'],ball['opponent']))).unique()).tolist()))[1])).value_counts().index[0]
out

'SAS'